{ "apartments": [ { "title": "Amazing 2bdr seaview flat in the heart of Hurghada", "shortDescription": "4 guests2 bedrooms4 beds1 bath", "body": "If you want to stay in one of the most beautiful apartments in the heart of Hurghada you have chosen the right place. The building is finished in July 2019 and the flat just new furnished. You can see the sea while showering. The sea is the first thing you see when you wake up. The sea is just everywhere in this flat. Modern furnished and central located. Couple of beaches just around the corner. Public beach just on the other side of the street (40 meters till your toes are touching the water)", "location": "Hurghada", "imgLink": "https://a0.muscache.com/im/pictures/e65d2a9c-a220-45d5-97ab-64721bf5d78c.jpg", "price": 1000, "id": 1 }, { "title": "Superior Suite Back view Ground Floor 022", "shortDescription": "2 guestsStudio1 bed1 bath", "body": "For those who are seeking a wonderful lifestyle, Redcon Suites offers luxury studios for rent in the center of Hurghada SHERATON Rd, which offers many facilities : Beach access, just crossing the road. Free WIFI 3 elevators. 24 hours security.", "location": "Hurghada", "imgLink": "https://a0.muscache.com/im/pictures/miso/Hosting-51613832/original/2d6c77b3-2064-4ef2-834b-15756d8cd59e.jpeg", "price": 2000, "id": 2 }, { "title": "Villa Marina 2", "shortDescription": "2 guests1 bedroom2 beds1 bath", "body": "Beautiful house, designer renovation in a unique style! Functional, stylish and very cozy! The house has two apartments (the first floor - with access to the courtyard, the second floor - with a balcony, from the roof - a view of the sea and mountains). In the evenings, there is always a pleasant breeze from the sea. To the sea on foot -1 minute. Clean, quiet and safe area. Apartments: functional kitchen, cozy bedroom with air conditioning, pleasant lounge", "location": "Dahab", "imgLink": "https://a0.muscache.com/im/pictures/a6ff1a26-aaeb-48b8-a523-5d28428f6e96.jpg", "price": 3000, "id": 3 }, { "title": "Seaview Penthouse", "shortDescription": "3 guests1 bedroom2 beds1 bath", "body": "A home away from home... The penthouse is a wooden house overlooking Dahab’s most beautiful sceneries with a 360 view of The Sea and mountains. Indoor staircase leading to a private rooftop. Located in the centre of Dahab on the famous El Fanar Street. Close to most dive centers, super markets and shops etc... I am available at all times for any inquiries house/Dahab related (: The space 1 bedroom penthouse House is well equipped with TV, WiFi, washing machine, coffee machine and full kitchen", "location": "Dahab", "imgLink": "https://a0.muscache.com/im/pictures/edd54516-36d0-4ae1-b4e2-f963c5a00454.jpg", "price": 4000, "id": 4 }, { "title": "Comfy Single studio+Green Roof Top by Travelholic", "shortDescription": "1 guest1 bedroom1 bed1 bath", "body": "Lovely cosy Serviced Single Studio with green rooftop access in the heart of New Cairo - 5 minutes from Cairo Festival City - 5 mins from 90 Street - 20 Mins from The Airport It’s the perfect choice for leisure and business trips because of the comfy stay with all the services you need", "location": "Cairo", "imgLink": "https://a0.muscache.com/im/pictures/370031e0-2ada-4b1c-8793-d438926ec546.jpg", "price": 5000, "id": 5 }, { "title": "(R1) Luxuries Private Rooftop Studio W. Swim. Pool", "shortDescription": "2 guests1 bedroom1 bed1 bath", "body": "Lovely cosy Serviced Single Studio with green rooftop access in the heart of New Cairo - 5 minutes from Cairo Festival City - 5 mins from 90 Street - 20 Mins from The Airport It’s the perfect choice for leisure and business trips because of the comfy stay with all the services you need", "location": "Cairo", "imgLink": "https://a0.muscache.com/im/pictures/5346fab3-6a9d-4755-ad95-5f4a1ae18737.jpg", "price": 6000, "id": 6 } ]}
